## pandas

In [33]:
import pandas as pd

In [34]:
data_frame=pd.DataFrame()

In [35]:
type(data_frame)

pandas.core.frame.DataFrame

In [36]:
list
dics
series
numpy array

SyntaxError: invalid syntax (2970978154.py, line 4)

In [37]:
data=[1,2,3,4,5]

In [38]:
pd.DataFrame(data)

   0
0  1
1  2
2  3
3  4
4  5

In [39]:
data2=[["somu",26],["manish",18],["priya",23]]

In [40]:
data_frame2=pd.DataFrame(data2,columns=["name","age"],index=["first","second","third"])

In [41]:
data_frame2

          name  age
first     somu   26
second  manish   18
third    priya   23

In [42]:
data3={"name":["somu","sunny"],"age":[27,25]}

In [43]:
data_frame3=pd.DataFrame(data3)

In [44]:
data_frame3

    name  age
0   somu   27
1  sunny   25

In [45]:
data4=[{"sunny":25},{"somu":31,"amit":35,"rahul":35}]

In [46]:
pd.DataFrame(data4)

   sunny  somu  amit  rahul
0   25.0   NaN   NaN    NaN
1    NaN  31.0  35.0   35.0

In [51]:
pd.read_csv("text.csv")

    name  age desin  salary
0   somu   21    ml  125554
1  sunny   22    ai    5655
2  monic   15   web    2555

In [54]:
pd.read_csv("dataset/text2.tsv")

  name\tage\tdesin\tsalary
0     somu\t21\tml\t125554
1      sunny\t22\tai\t5655
2     monic\t15\tweb\t2555

In [22]:
print("helo")

helo

In [25]:
import os
print(os.listdir("C:/Users/YourUsername/Desktop/Python_for_AI_ML/15_pandas"))

FileNotFoundError: [WinError 3] The system cannot find the path specified: 'C:/Users/YourUsername/Desktop/Python_for_AI_ML/15_pandas'